1) 
mkdir test:			 ساخت دارکتوری تست	
cp main.c demo.h test:   کپی دو فایل درون دایرکتوری تست
rm -r test:		 	 حذف دایرکتوری تست

2)
whatis pwd: 	دستوری برای نمایش دایرکتوری که در حال کار بر روی آن هستیم
whatis rmdir:	دستوری برای حذف دایرکتوری های خالی
whatis find: 	دستوری برای جستجوی فایل یا دایرکتوری
whatis stat:	دستوری برای نمایش اطلاعتی درمورد فایل موردنظر
whatis cat:		دستوری برای ساخت,مشاهده یا ترکیب چند فایل
whatis wc:		دستوری برای نمایش تعداد کلمه ها,کارکترها و بیت های فایل یا ورودی وارد شده