1)
arch Command: 		x86_64 نمایش معماری کامپیوتر مثل 
uptime Command: 		نمایش مدت زمان اکتیو بودن سیستم
exit Command: 		خروج از شل(ترمینال)
free Command: 		نمایش میزان رم و سواپ استفاده شده  در سیستم
du Documents Command: 	Documents نمایش میزان حافظه ی اشغال شده توسط دایرکتوری

2) بله ترمینال به کوچک و بزرگ بودن حروف دستورات حساس است

3) 
mkdir test:		 ساخت دارکتوری تست
cd test:		 رفتن به داخل دایرکتوری
touch myDoc.sh:	 ساخت یک فایل داخل دایرکتوری
cd .. :		 بازگشت به دایرکتوری بالاتر
rm -r test:		 حذف دایرکتوری تست
